#### Terraform Plan ('src/domains/cgn/prod') 📖
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.apim_itn.module.api_v2_cgn_support_func.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = (known after apply)
      + description           = "CGN SUPPORT API for IO platform."
      + display_name          = "IO CGN SUPPORT API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-cgn-support-api"
      + path                  = "api/v1/cgn-support"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.1
                info:
                  title: IO Functions CGN Support
                  description: |
                    Documentation of the IO Function API here.
                  contact:
                    name: IO team
                    url: https://forum.italia.it/c/progetto-io
                  version: 1.0.0
                  x-logo:
                    url: https://io.italia.it/assets/img/io-logo-blue.svg
                servers:
                  - url: https://api.cd.italia.it/api/v1/cgn-support
                security:
                  - ApiKey: []
                paths:
                  /user-info/{fiscalcode}:
                    post:
                      summary: Get user informations about CGN
                      description: "Retrieves useful informations about the user with regards to CGN"
                      operationId: getCgnUserInfo
                      requestBody:
                        description: Optional description in *Markdown*
                        required: true
                        content:
                          application/json:
                            schema:
                              $ref: "#/components/schemas/FiscalCodePayload"
                      responses:
                        "200":
                          description: CGN details.
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/UserInfo"
                        "400":
                          description: Bad Request, maybe body payload is not valid.
                          content: {}
                        "401":
                          description: Wrong or missing function key.
                          content: {}
                        "404":
                          description: No CGN found.
                          content: {}
                        "500":
                          description: Service unavailable.
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"             
                components:
                  schemas:
                    FiscalCodePayload:
                      type: object
                      properties:
                        fiscal_code:
                          $ref: '#/components/schemas/FiscalCode'
                      required:
                        - fiscal_code
                      example: | 
                        {
                          "fiscal_code": "AAABBB00C00D000E"
                        }
                    FiscalCode:
                      type: string
                      description: User's fiscal code.
                      format: FiscalCode
                      x-import: '@pagopa/ts-commons/lib/strings'
                      example: AAABBB00C00D000E
                    Timestamp:
                      type: string
                      description: A date-time field in ISO-8601 format and UTC timezone.
                      format: UTCISODateFromString
                      example: 2018-10-13T00:00:00.000Z
                      x-import: "@pagopa/ts-commons/lib/dates"
                    UserInfo:
                      required:
                        - cgn_card
                      type: object
                      properties:
                        cgn_card:
                          $ref: "#/components/schemas/Card"
                        eyca_card:
                          $ref: "#/components/schemas/EycaCard"
                    CommonCard:
                      type: object
                      properties:
                        activation_date:
                          $ref: "#/components/schemas/Timestamp"
                        expiration_date:
                          $ref: "#/components/schemas/Timestamp"
                      required:
                        - activation_date
                        - expiration_date
                    CardPending:
                      type: object
                      properties:
                        status:
                          type: string
                          x-extensible-enum:
                            - PENDING
                      required:
                        - status
                    CardActivated:
                      allOf:
                        - $ref: "#/components/schemas/CommonCard"
                        - type: object
                          properties:
                            status:
                              type: string
                              x-extensible-enum:
                                - ACTIVATED
                          required:
                            - status
                    CardRevoked:
                      allOf:
                        - $ref: "#/components/schemas/CommonCard"
                        - type: object
                          properties:
                            status:
                              type: string
                              x-extensible-enum:
                                - REVOKED
                            revocation_date:
                              $ref: "#/components/schemas/Timestamp"
                            revocation_reason:
                              type: string
                              minLength: 1
                          required:
                            - status
                            - revocation_date
                            - revocation_reason
                    CardExpired:
                      allOf:
                        - $ref: "#/components/schemas/CommonCard"
                        - type: object
                          properties:
                            status:
                              type: string
                              x-extensible-enum:
                                - EXPIRED
                          required:
                            - status
                    CardPendingDelete:
                      allOf:
                        - $ref: "#/components/schemas/CommonCard"
                        - type: object
                          properties:
                            status:
                              type: string
                              x-extensible-enum:
                                - PENDING_DELETE
                          required:
                            - status
                    Card:
                      x-one-of: true
                      allOf:
                        - $ref: "#/components/schemas/CardPending"
                        - $ref: "#/components/schemas/CardPendingDelete"
                        - $ref: "#/components/schemas/CardActivated"
                        - $ref: "#/components/schemas/CardRevoked"
                        - $ref: "#/components/schemas/CardExpired"
                      x-example: 
                        status: ACTIVATED
                        activation_date: "2021-10-13T00:00:00.000Z"
                        expiration_date: "2030-10-13T00:00:00.000Z"
                    CcdbNumber:
                      type: string
                      description: The internal CCDB Card number
                      pattern: "^[A-Z][0-9]{3}-[A-Z][0-9]{3}-[A-Z][0-9]{3}-[A-Z][0-9]{3}$"
                      minLength: 1
                    EycaCardActivated:
                      allOf:
                        - $ref: "#/components/schemas/CardActivated"
                        - type: object
                          properties:
                            card_number:
                              $ref: "#/components/schemas/CcdbNumber"
                          required:
                            - card_number
                    EycaCardExpired:
                      allOf:
                        - $ref: "#/components/schemas/CardExpired"
                        - type: object
                          properties:
                            card_number:
                              $ref: "#/components/schemas/CcdbNumber"
                          required:
                            - card_number
                    EycaCardRevoked:
                      allOf:
                        - $ref: "#/components/schemas/CardRevoked"
                        - type: object
                          properties:
                            card_number:
                              $ref: "#/components/schemas/CcdbNumber"
                          required:
                            - card_number
                    EycaCardPendingDelete:
                      allOf:
                        - $ref: "#/components/schemas/CardPendingDelete"
                        - type: object
                          properties:
                            card_number:
                              $ref: "#/components/schemas/CcdbNumber"
                          required:
                            - card_number
                    EycaCard:
                      x-one-of: true
                      allOf:
                        - $ref: "#/components/schemas/CardPending"
                        - $ref: "#/components/schemas/EycaCardPendingDelete"
                        - $ref: "#/components/schemas/EycaCardActivated"
                        - $ref: "#/components/schemas/EycaCardRevoked"
                        - $ref: "#/components/schemas/EycaCardExpired"
                      x-example: 
                        status: ACTIVATED
                        activation_date: "2021-10-13T00:00:00.000Z"
                        expiration_date: "2030-10-13T00:00:00.000Z"
                    ProblemJson:
                      type: object
                      properties:
                        type:
                          type: string
                          description: |-
                            An absolute URI that identifies the problem type. When dereferenced,
                            it SHOULD provide human-readable documentation for the problem type
                            (e.g., using HTML).
                          format: uri
                          example: https://example.com/problem/constraint-violation
                          default: about:blank
                        title:
                          type: string
                          description: |-
                            A short, summary of the problem type. Written in english and readable
                            for engineers (usually not suited for non technical stakeholders and
                            not localized); example: Service Unavailable
                        status:
                          $ref: "#/components/schemas/HttpStatusCode"
                        detail:
                          type: string
                          description: |-
                            A human readable explanation specific to this occurrence of the
                            problem.
                          example: There was an error processing the request
                        instance:
                          type: string
                          description: |-
                            An absolute URI that identifies the specific occurrence of the problem.
                            It may or may not yield further information if dereferenced.
                          format: uri
                    HttpStatusCode:
                      maximum: 600
                      exclusiveMaximum: true
                      minimum: 100
                      type: integer
                      description: |-
                        The HTTP status code generated by the origin server for this occurrence
                        of the problem.
                      format: int32
                      example: 200
                  securitySchemes:
                    ApiKey:
                      type: apiKey
                      description: The API key to access this function app.
                      name: X-Functions-Key
                      in: header
            EOT
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim_itn.module.api_v2_cgn_support_func.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-cgn-support-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                  <base />
                  <set-backend-service base-url="{{cgnonboardingportal-os-url}}/api/v1/cgn/operator-search" />
                  <set-header name="x-functions-key" exists-action="override">
                      <value>{{cgnonboardingportal-os-key}}</value>
                  </set-header>
                  <set-header name="{{cgnonboardingportal-os-header-name}}" exists-action="override">
                      <value>true</value>
                  </set-header>
              </inbound>
              <outbound>
                  <base />
              </outbound>
            </policies>
        EOT
    }

  # module.apim_itn.module.api_v2_cgn_support_func.azurerm_api_management_product_api.this["cgnsupportfunc"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-cgn-support-api"
      + id                  = (known after apply)
      + product_id          = "cgnsupportfunc"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim_itn.module.apim_v2_product_cgn_support_func.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + approval_required     = false
      + description           = "Product for CGN Support Api"
      + display_name          = "IO CGN API SUPPORT"
      + id                    = (known after apply)
      + product_id            = "cgnsupportfunc"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = true
    }

  # module.apim_itn.module.apim_v2_product_cgn_support_func.azurerm_api_management_product_policy.this[0] will be created
  + resource "azurerm_api_management_product_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + id                  = (known after apply)
      + product_id          = "cgnsupportfunc"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
              <inbound>
                  <base />
                  <rate-limit-by-key calls="300" renewal-period="10" counter-key="@(context.Request.Headers.GetValueOrDefault("X-Forwarded-For"))" remaining-calls-header-name="x-rate-limit-remaining" retry-after-header-name="x-rate-limit-retry-after" />
              </inbound>
              <backend>
                  <base />
              </backend>
              <outbound>
                  <base />
              </outbound>
              <on-error>
                  <base />
              </on-error>
            </policies>
        EOT
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on ../_modules/apim/api_cgn_support.tf line 41, in module "api_v2_cgn_support_func":
  41:   content_value  = data.http.cgn_support_func_openapi.body

The attribute "body" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
